org/lit/alonso_current_2019.org
#+setupfile: ./hugo_setup.org
#+title: alonso_current_2019: Current Research Trends in Robot Grasping and Bin Picking
#+roam_key: cite:alonso_current_2019

* Current Research Trends in Robot Grasping and Bin Picking
  :PROPERTIES:
  :Custom_ID: alonso_current_2019
  :URL:
  :AUTHOR: Alonso, M., Izaguirre, A., & Graña, M.
  :NOTER_DOCUMENT: /home/jethro/Zotero/storage/3DYE53G7/Alonso et al. - 2019 - Current Research Trends in Robot Grasping and Bin .pdf
  :NOTER_PAGE: 7
  :END:
** [[file:robot_grasping.org][Robot Grasping]]
:PROPERTIES:
:NOTER_PAGE: (2 . 0.7170731707317073)
:END:
** Traditional Bin-picking Approaches
:PROPERTIES:
:NOTER_PAGE: (4 . 0.5590243902439025)
:ID:       7267eb56-6fdd-4646-8531-f34b30f66d86
:END:

Most algorithms rely on segmentation of RGB-D data. 3D object recognition is
done by matching 3D data to their known CAD models. [[file:interactive_closest_point.org][Interactive Closest Point]]
can be used to calculate the alignment and best fitting of a cloud of points
with respect to a reference CAD model.

A fast voting scheme similar to the Generalized Hough Transform can be used improving the performance of [[file:interactive_closest_point.org][ICP]].
** Deep Learning Methodologies for Bin Picking
:PROPERTIES:
:NOTER_PAGE: (5 . 0.7798594847775175)
:ID:       1f41b785-4e36-4cc5-8419-7974f881c5ee
:END:

Deep Learning approaches used RGB-D images as input, and are able to predict
grasp success and generalize to novel objects.
